#include "SV_user.h"

#include <ctype.h>
#include "Modding.h"
#include "sys.h"
#include "VecMath.h"


/*** STRUCTS ***/
typedef struct temp_move_s { //0x54, has now been reordered since it seems to be unique.

   int IsActive; //00, this entity is being processed.
   int IsMoving; //04 destination and origin are not the same.
   int FirstIteration; //54
   int DoNotInterpolate; //44

   vec3_t Mins; //2C
   vec3_t Maxs; //38
   vec3_t CurrentPosition; //20
   vec3_t OldLocation; //14
   vec3_t NewLocation; //08
   vec3_t FinalVectors; //48
} temp_move_t;


/*** GLOBALS ***/

unsigned int SV_UPDATE_MASK = 7;
unsigned int SV_UPDATE_BACKUP = 8;

static int nofind = 0;
static temp_move_t truepositions[32]; //That'll need to be dynamic.  Can't have 600 players elsewise.

static cvar_t cvar_sv_maxrate       = {       "sv_maxrate",    "0", FCVAR_SERVER,  0.0, NULL };
static cvar_t cvar_sv_minrate       = {       "sv_minrate",    "0", FCVAR_SERVER,  0.0, NULL };
static cvar_t cvar_sv_maxupdaterate = { "sv_maxupdaterate", "30.0", FCVAR_NONE,   30.0, NULL };
static cvar_t cvar_sv_minupdaterate = { "sv_minupdaterate", "10.0", FCVAR_NONE,   10.0, NULL };
static cvar_t cvar_sv_unlag         = {         "sv_unlag",    "1", FCVAR_NONE,    1.0, NULL };
static cvar_t cvar_sv_maxunlag      = {      "sv_maxunlag",  "0.5", FCVAR_NONE,    0.5, NULL };
static cvar_t cvar_sv_unlagpush     = {     "sv_unlagpush",  "0.0", FCVAR_NONE,    0.0, NULL };
